% システム同定 期末課題用プログラム
% コモタ

% ------------------------------------------------------------
% 課題 1-1

mu = [0 0];
sigma = [1 0.5;0.5 2];
R = chol(sigma);
z = repmat(mu, 10, 1) + randn(10, 2)*R

% ------------------------------------------------------------

% 検算
me = 0;
for v = z
    me = 0;
    for i = 1:length(v)
        me = me + v(i);
    end
    me = me / length(v)
end
% ------------------------------------------------------------
% 課題 1-4

error = 0;

for t = 1:10
    
    mu = [0 0];
    sigma = [1 0.5;0.5 2];
    R = chol(sigma);
    z = repmat(mu, 10, 1) + randn(10, 2)*R;

    
    for idx = 1:10
        x_hat = (1/(4*sqrt(pi)))*(z(idx, 2)/2)*exp(-(z(idx, 2)/2)^2);
        error = error + (v(idx, 1) - x_hat)^2;
    end
    error = error / 9
end
% ------------------------------------------------------------



