{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 28, 28, 3], "name": "conv2d_1", "dtype": "float32", "kernel_regularizer": null, "filters": 128, "use_bias": true, "strides": [2, 2], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.20000000298023224}, "class_name": "LeakyReLU"}, {"config": {"kernel_constraint": null, "name": "conv2d_2", "kernel_regularizer": null, "filters": 256, "use_bias": true, "strides": [2, 2], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.20000000298023224}, "class_name": "LeakyReLU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 512, "name": "dense_1", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.20000000298023224}, "class_name": "LeakyReLU"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1, "name": "dense_2", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}