{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 28], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 2048, "kernel_constraint": null, "name": "dense_3", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 12544, "name": "dense_4", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "reshape_1", "trainable": true, "target_shape": [7, 7, 256]}, "class_name": "Reshape"}, {"config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "filters": 128, "use_bias": true, "strides": [1, 1], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_4", "kernel_regularizer": null, "filters": 3, "use_bias": true, "strides": [1, 1], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}], "class_name": "Sequential"}